# 빈 자리는 빈공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
print("{0: >10}".format(500))

# {0: >10} 의미
# : 다음 space = 빈공간(공백)
# > = 오른쪽 정렬
# 10 = 총 10자리 공간을 확보 

# 양수 일때는 + 표시, 음수일 땐 -로 표시
print("{0: >+10}".format(500))
print("{0: >+10}".format(-500))

# + = 부호를 표시

# 왼쪽 정렬을 하고, 빈칸을 _로 채우기
print("{0:_<+10}".format(500))

# < = 왼쪽 정렬


# 3자리 마다 콤마를 찍어주기
print("{0:,}".format(100000000000))

# 3자리 마다 콤마를 찍어주기
# 부호 찍어주기
print("{0:+,}".format(100000000000))

# 3자리 마다 콤마를 찍어주기
# 부호 찍어주기
# 자리수 확보
# 빈자리는 ^로 채우기
print("{0:^<+30,}".format(100000000000))

# 소수점 출력
print("{0:f}".format(5/3))

# 소수점을 특정 자리수 까지만 표시(소수점 3째 자리에서 반올림)
print("{0:.2f}".format(5/3))

